## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/21054082031)



<pre><code>Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.markets_delivery_prod_read,
  on restricted-markets-delivery.tf line 22, in resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_prod_read&#34;:
  22: resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_prod_read&#34; {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership &#39;kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;description&#34;: &#34;Error(4003): Cannot create membership &#39;kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com&#39; in &#39;groups/00xvir7l1dtv8ew&#39; because it already exists.&#34;,
    &#34;owner&#34;: &#34;domain:cloudidentity.googleapis.com&#34;,
    &#34;resourceType&#34;: &#34;cloudidentity.googleapis.com/Membership&#34;
  }
]

  with google_cloud_identity_group_membership.security_scanners_prod_read,
  on service_accounts.tf line 85, in resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_prod_read&#34;:
  85: resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_prod_read&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
github_actions_organization_variable.gcp_kyma_project_project_id: Refreshing state... [id=GCP_KYMA_PROJECT_PROJECT_ID]
data.github_organization.kyma_project: Reading...
data.github_repository.test_infra: Reading...
github_actions_variable.github_terraform_executor_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_EXECUTOR_SECRET_NAME]
data.github_repository.gitleaks_repository["test-infra"]: Reading...
github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name: Refreshing state... [id=IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME]
github_actions_variable.github_terraform_planner_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_PLANNER_SECRET_NAME]
data.github_repository.kyma_modules_internal: Reading...
google_service_account.kyma-security-scanners: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
data.github_repository.kyma_modules_internal: Read complete after 0s [id=kyma-modules]
google_service_account.sa-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Reading...
google_service_account.sec-scanner-cfg-processor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sec-scanner-cfg-processor@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-secret-update: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Reading...
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_secret_manager_secret.internal_github_terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_service_account.terraform-executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.image_syncer_reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.internal_github_terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token]
google_secret_manager_secret.dora_integration_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/dora-integration-gh-tools-serviceuser-token]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
google_secret_manager_secret.kyma_bot_public_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
google_service_account.kyma-oci-image-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
google_secret_manager_secret.sec-scanner-cfg-processor-gcp-sa-key: Refreshing state... [id=projects/sap-kyma-prow/secrets/sec-scanner-cfg-gcp-sa-key]
google_service_account.neighbors-conduit-cli-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/neighbors-conduit-cli-builder@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Reading...
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
google_service_account.kyma-submission-pipeline: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.image_syncer_writer: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.data.google_project.project: Reading...
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.kyma_modules_runtime_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token]
module.signify_secret_rotator.google_service_account.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.kyma-modules-reader-modg: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/modg-vuln-mgmt-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.test_infra: Read complete after 2s [id=test-infra]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
data.google_client_config.gcp: Reading...
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Read complete after 0s [id=projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1]
google_service_account.terraform-planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.gitleaks_secret_accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.sa-security-dashboard-oauth: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com]
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.restricted-markets-artifactregistry-reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 0s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
google_service_account.gitleaks-secret-accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.gitleaks_repository["test-infra"]: Read complete after 2s [id=test-infra]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
data.google_project.current: Reading...
google_service_account.sa-dev-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.chainguard_pull_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token]
data.google_project.kyma_project: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.prod_docker_repository.data.google_client_config.this: Reading...
module.kyma_modules.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules]
module.kyma_restricted_images_prod.data.google_client_config.this: Reading...
module.chainguard_cache.data.google_client_config.this: Reading...
google_project_iam_member.kyma_developer_admin_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.viewer/group:kyma_developer_admin@sap.com]
module.signify_secret_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.kyma_project_image_builder: Refreshing state... [id=projects/kyma-project/serviceAccounts/azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
module.chainguard_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.prod_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_prod.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_project_iam_member.kyma_developer_admin_private_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.privateLogViewer/group:kyma_developer_admin@sap.com]
module.kyma_modules.data.google_client_config.this: Reading...
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
module.kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_project_iam_member.kyma_developer_admin_editor: Refreshing state... [id=kyma-project/roles/editor/group:kyma_developer_admin@sap.com]
data.google_project.current: Read complete after 0s [id=projects/sap-kyma-prow]
module.kyma_restricted_images_dev.data.google_client_config.this: Reading...
module.kyma_restricted_images_dev.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod]
module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev]
module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev]
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache]
module.dockerhub_mirror.data.google_client_config.this: Reading...
module.dockerhub_mirror.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod]
data.google_project.kyma_project: Read complete after 1s [id=projects/kyma-project]
module.dev_docker_repository.data.google_client_config.this: Reading...
module.dev_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_kyma_modules.data.google_client_config.this: Reading...
module.dev_kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.docker_cache.data.google_client_config.this: Reading...
module.docker_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
google_storage_bucket_iam_binding.planner_state_bucket_write_access: Refreshing state... [id=b/tf-state-kyma-project/roles/storage.objectUser]
github_actions_variable.gcp_terraform_planner_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_PLANNER_SERVICE_ACCOUNT_EMAIL]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/iam.securityReviewer"]: Refreshing state... [id=sap-kyma-prow/roles/iam.securityReviewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/storage.objectViewer"]: Refreshing state... [id=sap-kyma-prow/roles/storage.objectViewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/viewer"]: Refreshing state... [id=sap-kyma-prow/roles/viewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
google_secret_manager_secret_iam_member.terraform_planner_internal_github_planner_secret_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.internal_github_terraform_planner_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_PLANNER_SECRET_NAME]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.gcp_terraform_executor_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_EXECUTOR_SERVICE_ACCOUNT_EMAIL]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_organization_variable.image_syncer_reader_service_account_email: Refreshing state... [id=IMAGE_SYNCER_READER_SERVICE_ACCOUNT_EMAIL]
module.service_account_keys_rotator.google_monitoring_alert_policy.service_account_keys_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/8834342864758449670]
google_secret_manager_secret_iam_member.terraform_planner_internal_github_executor_secret_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.internal_github_terraform_executor_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_EXECUTOR_SECRET_NAME]
github_actions_organization_variable.dora_integration_internal_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
module.signify_secret_rotator.google_monitoring_alert_policy.signify_secret_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/5685251492968365145]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]
github_actions_organization_variable.dora_integration_public_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_PUBLIC_GITHUB_TOKEN_GCP_SECRET_NAME]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_organization_variable.image_syncer_writer_service_account_email: Refreshing state... [id=IMAGE_SYNCER_WRITER_SERVICE_ACCOUNT_EMAIL]
github_actions_variable.kyma_autobump_bot_github_token_secret_name: Refreshing state... [id=test-infra:KYMA_AUTOBUMP_BOT_GITHUB_SECRET_NAME]
google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:172960:repository_owner_id:2457:workflow:Update Component Version on Push]
github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name: Refreshing state... [id=kyma-modules:KYMA_PROW_SERVICEUSER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/signify-secret-rotator]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_sa_keys_admin: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_run_service.service_account_keys_cleaner: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secret_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secrets_versions_manager: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionManager/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.sec_scanner_cfg_processor_secret_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sec-scanner-cfg-gcp-sa-key/roles/secretmanager.secretAccessor/serviceAccount:kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account_iam_member.restricted_markets_artifactregistry_reader_impersonation: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:gcr-writer@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
google_secret_manager_secret_iam_member.chainguard_token_terraform_planner_access: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.chainguard_pull_token_password: Reading...
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west1/services/security-dashboard-token]
google_secret_manager_secret_iam_member.chainguard_token_artifactregistry_access: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token/roles/secretmanager.secretAccessor/serviceAccount:service-905162714753@gcp-sa-artifactregistry.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.chainguard_pull_token_password: Read complete after 1s [id=projects/351981214969/secrets/chainguard_auth_token/versions/1]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
google_secret_manager_secret_iam_member.dora_integration_workflow_internal_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/dora-integration-gh-tools-serviceuser-token/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/attribute.reusable_workflow_ref/kyma/dora-integration/.github/workflows/dora-integration.yml@refs/heads/main]
google_secret_manager_secret_iam_member.dora_integration_workflow_public_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/attribute.reusable_workflow_ref/kyma/dora-integration/.github/workflows/dora-integration.yml@refs/heads/main]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["group:cam_dx_kyma_gcp_sre@sap.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/group:cam_dx_kyma_gcp_sre@sap.com]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
data.github_organization.kyma_project: Read complete after 7s [id=39153523]
module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_cloud_run_service_iam_member.service_account_keys_rotator_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-rotator/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_cloud_run_service_iam_member.signify_secret_rotator_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/signify-secret-rotator/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_pubsub_subscription.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/subscriptions/secrets-rotator-service-account-keys-rotator]
module.signify_secret_rotator.google_pubsub_subscription.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/subscriptions/secrets-rotator-signify-secret-rotator]
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/sap-kyma-prow/locations/global/workloadIdentityPools/github-com-kyma-project]
module.service_account_keys_cleaner.google_cloud_run_service_iam_member.service_account_keys_cleaner_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-cleaner/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.docker_cache.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache/roles/artifactregistry.repoAdmin/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.kyma_modules_reader: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.sec_scanner_cfg_processor_kyma_modules_reader: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:sec-scanner-cfg-processor@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.kyma_modules_reader_modg: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:modg-vuln-mgmt-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.image_syncer_prod_repo_reader: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod/roles/artifactregistry.reader/serviceAccount:image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod/roles/artifactregistry.createOnPushWriter/serviceAccount:image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/slack-message-sender]
module.slack_message_sender.google_eventarc_trigger.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/triggers/issue-labeled]
module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dockerhub-mirror]
module.github_webhook_gateway.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/github-webhook-gateway]
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main: Refreshing state... [id=projects/sap-kyma-prow/locations/global/workloadIdentityPools/github-com-kyma-project/providers/github-com-kyma-project]
google_service_account_iam_binding.terraform_planner_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_service_account_iam_member.image_syncer_reader_workflow_sa_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:pull_request_target:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main]
google_secret_manager_secret_iam_member.image_builder_reusable_workflow_principal_ado_pat_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/image-builder-ado-pat/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_ref/kyma-project/test-infra/.github/workflows/image-builder.yml@refs/heads/main]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_service_account_iam_member.terraform_executor_workload_identity_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Post Apply Prod Terraform]
google_service_account_iam_member.terraform_planner_workload_identity_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Pull Plan Prod Terraform]
google_service_account_iam_member.image_syncer_writer_workflow_sa_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:push:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main]
google_service_account_iam_binding.gitleaks_workload_identity_federation_binding["test-infra"]: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.chainguard_cache.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/chainguard-cache]
github_actions_organization_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider: Refreshing state... [id=GH_COM_KYMA_PROJECT_GCP_WORKLOAD_IDENTITY_FEDERATION_PROVIDER]
module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dockerhub-mirror/roles/artifactregistry.repoAdmin/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
module.restricted_prod.data.google_client_config.this: Reading...
module.restricted_dev.data.google_client_config.this: Reading...
module.restricted_prod.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.restricted_dev.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.restricted_dev.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-dev]
module.restricted_prod.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-prod]
module.restricted_prod.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-prod-read@sap.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-prod/roles/artifactregistry.reader/group:kyma-restricted-registry-prod-read@sap.com]
google_artifact_registry_repository_iam_member.restricted_dev_writers: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-dev/roles/artifactregistry.writer/group:kyma-restricted-registry-dev-write@sap.com]
module.restricted_dev.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-dev-read@sap.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-dev/roles/artifactregistry.reader/group:kyma-restricted-registry-dev-read@sap.com]
google_artifact_registry_repository_iam_member.restricted_prod_writers: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-prod/roles/artifactregistry.writer/group:kyma-restricted-registry-prod-write@sap.com]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2026-01-15T17:18:57.720561Z" -> "2026-01-16T02:49:13.389698Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2026-01-15T17:20:07.584285Z" -> "2026-01-16T02:49:54.096954Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror"
        name                   = "dockerhub-mirror"
      ~ update_time            = "2026-01-15T17:14:40.282180Z" -> "2026-01-16T02:46:38.148663Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2026-01-15T15:25:23.017130Z" -> "2026-01-16T00:59:01.403580Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # google_cloud_identity_group_membership.markets_delivery_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-markets-delivery@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_prod_read will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/03fwokq04jj0scm"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_prod_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/00meukdy10z0qky"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ service_account_keys_cleaner                   = {
      ~ service_account_keys_cleaner_cloud_run_service = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "c00b0bc4-12eb-43dd-be36-58ce857ec53c" -> "fd1c5baa-41b6-47b2-b72b-0098d2ebceb2"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 292 -> 293
                  ~ resource_version      = "AAZIYAps9ec" -> "AAZIcHy2d5s"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-cleaner"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-cleaner-00292-pzs" -> "service-account-keys-cleaner-00293-6n9"
                  ~ latest_ready_revision_name   = "service-account-keys-cleaner-00292-pzs" -> "service-account-keys-cleaner-00293-6n9"
                  ~ observed_generation          = 292 -> 293
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-cleaner-00292-pzs" -> "service-account-keys-cleaner-00293-6n9"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (2 unchanged attributes hidden)
    }
  ~ service_account_keys_rotator                   = {
      ~ service_account_keys_rotator_cloud_run_service   = {
            id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator"
          ~ metadata                   = [
              ~ {
                  ~ effective_annotations = {
                      ~ "run.googleapis.com/operation-id"   = "70c49856-4444-4337-bdfb-76a0eb5a3c8d" -> "99304424-e932-492b-8d4e-99858e7447c1"
                        # (5 unchanged attributes hidden)
                    }
                  ~ generation            = 38 -> 39
                  ~ resource_version      = "AAZIYAptDHk" -> "AAZIcHzCY34"
                    # (7 unchanged attributes hidden)
                },
            ]
            name                       = "service-account-keys-rotator"
          ~ status                     = [
              ~ {
                  ~ latest_created_revision_name = "service-account-keys-rotator-00038-jzd" -> "service-account-keys-rotator-00039-nml"
                  ~ latest_ready_revision_name   = "service-account-keys-rotator-00038-jzd" -> "service-account-keys-rotator-00039-nml"
                  ~ observed_generation          = 38 -> 39
                  ~ traffic                      = [
                      ~ {
                          ~ revision_name   = "service-account-keys-rotator-00038-jzd" -> "service-account-keys-rotator-00039-nml"
                            # (4 unchanged attributes hidden)
                        },
                    ]
                    # (2 unchanged attributes hidden)
                },
            ]
            # (6 unchanged attributes hidden)
        }
        # (3 unchanged attributes hidden)
    }
google_cloud_identity_group_membership.security_scanners_prod_read: Creating...
google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group: Creating...
google_cloud_identity_group_membership.security_scanners_group_to_prod_read: Creating...
google_cloud_identity_group_membership.markets_delivery_prod_read: Creating...
google_cloud_identity_group_membership.markets_delivery_group_to_prod_read: Creating...
google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group: Creating...
google_cloud_identity_group_membership.security_scanners_group_to_dev_read: Creating...
google_cloud_identity_group_membership.security_scanners_group_to_prod_read: Creation complete after 0s [id=groups/00xvir7l1dtv8ew/memberships/00meukdy10z0qky]
google_cloud_identity_group_membership.markets_delivery_group_to_prod_read: Creation complete after 1s [id=groups/00xvir7l1dtv8ew/memberships/03fwokq04jj0scm]
google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group: Creation complete after 1s [id=groups/00meukdy10z0qky/memberships/116026471765855676444]
google_cloud_identity_group_membership.security_scanners_group_to_dev_read: Creation complete after 1s [id=groups/0184mhaj2tdduaw/memberships/00meukdy10z0qky]
google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group: Creation complete after 1s [id=groups/03fwokq04jj0scm/memberships/116475765156525953628]

Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.markets_delivery_prod_read,
  on restricted-markets-delivery.tf line 22, in resource "google_cloud_identity_group_membership" "markets_delivery_prod_read":
  22: resource "google_cloud_identity_group_membership" "markets_delivery_prod_read" {


Error: Error creating GroupMembership: googleapi: Error 409: Error(4003): Cannot create membership 'kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00xvir7l1dtv8ew' because it already exists.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "description": "Error(4003): Cannot create membership 'kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com' in 'groups/00xvir7l1dtv8ew' because it already exists.",
    "owner": "domain:cloudidentity.googleapis.com",
    "resourceType": "cloudidentity.googleapis.com/Membership"
  }
]

  with google_cloud_identity_group_membership.security_scanners_prod_read,
  on service_accounts.tf line 85, in resource "google_cloud_identity_group_membership" "security_scanners_prod_read":
  85: resource "google_cloud_identity_group_membership" "security_scanners_prod_read" {

::error::OpenTofu exited with code 1.

```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":13714,"Program":"tfcmt","SHA1":"b227b8bbf6a54dd58714f1f9dcce8902660e3ff3","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->